/* Name for a batch create failure method.
   Name for a count aggregate failure method. */
"create" = "create";

/* Name for a batch delete failure method.
   Name for a max aggregate failure method.
   Name for a min aggregate failure method. */
"delete" = "delete";

/* Description of a CRUD operation error. */
"Encountered the following error while executing a %@: %@" = "Encountered the following error while executing a %1$@: %2$@";

/* Description of a batch operation error. */
"Encountered the following error while executing a batch %@: %@" = "Encountered the following error while executing a batch %1$@: %2$@";

/* Description of a fetch operation error. */
"Encountered the following error while executing a fetch: %@" = "Encountered the following error while executing a fetch: %@";

/* Description of an aggregate operation error. */
"Encountered the following error while executing an aggregate %@: %@" = "Encountered the following error while executing an aggregate %1$@: %2$@";

/* Name for a batch read failure method.
   Name for a sum aggregate failure method. */
"read" = "read";

/* Error code for when an object can't be found for the provided NSManagedObjectID */
"The provided NSManagedObjectID does not correlate to any object in the CoreData store." = "The provided NSManagedObjectID does not correlate to any object in the CoreData store.";

/* Error code for when the developer does not provide a valid pair of NSAttributeDescription and NSPropertyDescription (or any of their child types). */
"There is a mismatch between a provided NSPropertyDescrption's entity and a NSEntityDescription. When a property description is provided, it must match any related entity descriptions." = "There is a mismatch between a provided NSPropertyDescrption's entity and a NSEntityDescription. When a property description is provided, it must match any related entity descriptions.";

/* Fallback error code for when the cause is unknown. */
"Unknown error." = "Unknown error.";

/* Name for a average aggregate failure method.
   Name for a batch update failure method. */
"update" = "update";

